uhnp/src/InformationRegisters/СтатьиТоварныхКатегорий/СтатьиТоварныхКатегорий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатьиТоварныхКатегорий</name>
  <resources>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>УсловиеОплаты</name>
    <type>
      <types>CatalogRef.УсловияОплаты</types>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/ChartsOfCharacteristicTypes/ВидыБюджетов/ВидыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыБюджетов</name>
  <type>
    <types>CatalogRef.СтатьиДоходовИРасходов</types>
    <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.ГруппыСтатейБюджета</types>
  </type>
  <predefined>
    <items>
      <name>БюджетДвиженияДенежныхСредств</name>
      <description>Бюджет движения денежных средств</description>
      <code>БДДС</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>БюджетДоходовИРасходов</name>
      <description>Бюджет доходов и расходов</description>
      <code>БДР</code>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </items>
    <items>
      <name>БюджетДвиженияРесурсов</name>
      <description>Бюджет закупок</description>
      <code>Ресурсы</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияРесурсов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВалютнаяПоУмолчанию</name>
    <type>
      <types>EnumRef.ВариантыУстановкиПризнакаВалютнаяСтатьиБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКонтролироватьНаправление</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

uhnp/src/InformationRegisters/СтатьиТоварныхКатегорий/Forms/ФормаНастройкиСтатей/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	
	ОтражениеВБюджетах 			= ПланированиеПотребностей.ОтражениеВБюджетахПоставок(ТекущаяДата());    
	Если ЗначениеЗаполнено(ОтражениеВБюджетах.ВидБюджетаЗакупок) Тогда
		ЭтотОбъект.ВидБюджета 		= ОтражениеВБюджетах.ВидБюджетаЗакупок;        
		ЭтотОбъект.ВидБюджетаСтарый = ОтражениеВБюджетах.ВидБюджетаЗакупок;
	Иначе
		ЭтотОбъект.ВидБюджета 		= ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств;    
		ЭтотОбъект.ВидБюджетаСтарый 		= ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств;   
	КонецЕсли;
	ОбновитьФорму();
	
	ДобавитьИОбновитьПараметрыСтатей();
	
	Если Параметры.Свойство("Ссылка") Тогда
		Строки = СтатьиТК.НайтиСтроки(Новый Структура("ТоварнаяКатегория", Параметры.Ссылка));
		Если Строки.Количество() Тогда
			ИдентификаторИнициализации = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;   
	
	Если ОбщегоНазначения.ПодсистемаСуществует("БухгалтерияПредприятияПодсистемы") Тогда
		Элементы.ПланыДокументаУсловиеОплаты.Видимость = Истина;
		ТипКатегории = "СправочникСсылка.ТоварныеКатегории"; 
		Элементы.ПланыДокументаТоварнаяКатегория.Заголовок = НСтр("ru = 'Товарная категория'");
	Иначе
		Элементы.ПланыДокументаУсловиеОплаты.Видимость = Ложь;
		ТипКатегории = "СправочникСсылка.КатегорииЗакупок"; 
		Элементы.ПланыДокументаТоварнаяКатегория.Заголовок = НСтр("ru = 'Категория закупок'");
	КонецЕсли;
	Элементы.ПланыДокументаТоварнаяКатегория.ОграничениеТипа = Новый ОписаниеТипов(
										ОбщегоНазначенияКлиентСервер.МассивЗначений(Тип(ТипКатегории)));
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьИОбновитьПараметрыСтатей()
	
	Перем МассивОписанийСтатей, ПараметрыПоляВводаШапки;
	
	ПараметрыПоляВводаШапки = Новый Структура;
	ПараметрыПоляВводаШапки.Вставить("АвтоМаксимальнаяШирина",	Истина);
	ПараметрыПоляВводаШапки.Вставить("МаксимальнаяШирина",		0);
	
	МассивОписанийСтатей = Новый Массив;
	АналитикиСтатейБюджетовУХ.СтатьяИАналитикиТаблицыЗначенийРеквизитаФормыВТаблицеФормы(МассивОписанийСтатей,
								"СтатьиТК", "СтатьиТК",
								"СтатьяБюджета", "ПланыДокументаСтатьяБюджета",
								"Аналитика%1", "ПланыДокументаАналитика%1",
								ФормыУХ.РазместитьВГруппеСтрокой(Элементы.ПланыДокументаГруппаСтатьяИАналитики));
	АналитикиСтатейБюджетовУХ.СоздатьСтатьиБюджетовИАналитики(ЭтаФорма, МассивОписанийСтатей, ПараметрыПоляВводаШапки);
	
	Элементы.ПланыДокументаУсловиеОплаты.Видимость = ОбщегоНазначения.ПодсистемаСуществует("БухгалтерияПредприятияПодсистемы") И ЭтотОбъект.ВидБюджета = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств;
КонецПроцедуры

&НаСервере
Процедура ОбновитьФорму()
	
	ЭтотОбъект.ВидБюджетаСтарый = ЭтотОбъект.ВидБюджета;
	ОграничениеТипа = ЭтотОбъект.ВидБюджета.ТипЗначения;
	Элементы.ПланыДокументаСтатьяБюджета.ОграничениеТипа = ОграничениеТипа;	
	ЗагрузитьСтатьиТК();
	
	ДобавитьИОбновитьПараметрыСтатей();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСтатьиТК()
	
	Перем Запрос, РезультатЗапроса;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
					"ВЫБРАТЬ
					|	ТоварныеКатегории.Ссылка КАК ТоварнаяКатегория,
					|	СтатьиТоварныхКатегорий.СтатьяБюджета КАК СтатьяБюджета,
					|	СтатьиТоварныхКатегорий.Аналитика1 КАК Аналитика1,
					|	СтатьиТоварныхКатегорий.Аналитика2 КАК Аналитика2,
					|	СтатьиТоварныхКатегорий.Аналитика3 КАК Аналитика3,
					|	СтатьиТоварныхКатегорий.Аналитика4 КАК Аналитика4,
					|	СтатьиТоварныхКатегорий.Аналитика5 КАК Аналитика5,
					|	СтатьиТоварныхКатегорий.Аналитика6 КАК Аналитика6,
					|	СтатьиТоварныхКатегорий.УсловиеОплаты КАК УсловиеОплаты
					|ИЗ
					|	Справочник.ТоварныеКатегории КАК ТоварныеКатегории
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатьиТоварныхКатегорий КАК СтатьиТоварныхКатегорий
					|		ПО (СтатьиТоварныхКатегорий.ТоварнаяКатегория = ТоварныеКатегории.Ссылка)
					|			И (СтатьиТоварныхКатегорий.ВидБюджета = &ВидБюджета)";
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("БухгалтерияПредприятияПодсистемы") Тогда    
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ТоварныеКатегории", "Справочник.КатегорииЗакупок");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидБюджета", ВидБюджета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтатьиТК.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ВидБюджетаПриИзменении(Элемент)    
	ОбновитьФорму(); 
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтатьяБюджета_ПриИзменении(Элемент)
	
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииСтатьиБюджета(ЭтотОбъект, Элемент.Имя);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АналитикаСтатьиБюджета_ПриИзменении(Элемент)
	
	АналитикиСтатейБюджетовУХКлиент.ПриИзмененииАналитикиСтатьиБюджета(ЭтотОбъект, Элемент.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()  
	Записи = СтатьиТК.Выгрузить();  
	Записи.Колонки.Добавить("ВидБюджета");
	Записи.ЗаполнитьЗначения(ЭтотОбъект.ВидБюджетаСтарый, "ВидБюджета");
	
	Набор = РегистрыСведений.СтатьиТоварныхКатегорий.СоздатьНаборЗаписей();
	Набор.Отбор.ВидБюджета.Установить(ЭтотОбъект.ВидБюджетаСтарый);
	Набор.Загрузить(Записи);    
	Набор.Записать(Истина);  
	
	ЭтотОбъект.Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтатьиТКПриАктивизацииСтроки(Элемент)       
	
КонецПроцедуры    

&НаКлиенте
Процедура СтатьиТКПередНачаломИзменения(Элемент, Отказ)
	ИдентификаторСтроки = Элементы.СтатьиТК.ТекущаяСтрока;     
	Если ИдентификаторСтроки <> Неопределено Тогда
		СтатьиТКПриАктивизацииСтрокиСервер(ИдентификаторСтроки);    
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СтатьиТКПриАктивизацииСтрокиСервер(Знач ИдентификаторСтроки)
	
	Перем ТекущаяСтрока;
	
	ТекущаяСтрока = СтатьиТК.НайтиПоИдентификатору(ИдентификаторСтроки); 
	
	ЦентрализованныеЗакупкиВызовСервераУХ.УстановитьДоступныеСтатьиЭлементаПоПараметруПотребностей(ЭтотОбъект, "ПланыДокументаСтатьяБюджета", ТекущаяСтрока.ТоварнаяКатегория, Неопределено, ЭтотОбъект.ВидБюджета);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуНаСервере(Идентификатор)   
	
	ДанныеСтроки = ЭтотОбъект.СтатьиТК.НайтиПоИдентификатору(Идентификатор);     
	
	СвойстваАналитики = "СтатьяБюджета, Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5, Аналитика6";               
	Если ВидБюджета = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств Тогда
		ВидБюджетаПараметр = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов;
	Иначе
		ВидБюджетаПараметр = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств;
	КонецЕсли;
	ПараметрСтатья = ПланированиеПотребностей.ПараметрыПотребности(Неопределено, ДанныеСтроки.ТоварнаяКатегория, СвойстваАналитики, Новый Структура("ВидБюджета", ВидБюджетаПараметр)); 
	
	Результат = ПланированиеПотребностей.ЗаменаСтатейИАналитикПоНастройкамЛимитов(ТекущаяДата(),, ПараметрСтатья.СтатьяБюджета, 
																			ПараметрСтатья.Аналитика1, ПараметрСтатья.Аналитика2,
																			ПараметрСтатья.Аналитика3, ПараметрСтатья.Аналитика4,
																			ПараметрСтатья.Аналитика5, ПараметрСтатья.Аналитика6); 
																			
	Если Результат = Неопределено Или Результат.СтатьяБюджета = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ДанныеСтроки.СтатьяБюджета 		= Результат.СтатьяБюджета; 
	ДанныеСтроки.Аналитика1 		= Результат.Аналитика1;  
	ДанныеСтроки.Аналитика2 		= Результат.Аналитика2;
	ДанныеСтроки.Аналитика3 		= Результат.Аналитика3;
	ДанныеСтроки.Аналитика4 		= Результат.Аналитика4;
	ДанныеСтроки.Аналитика5 		= Результат.Аналитика5;
	ДанныеСтроки.Аналитика6 		= Результат.Аналитика6; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтроку(Команда)
	ЗаполнитьСтрокуНаСервере(Элементы.СтатьиТК.ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	СвойстваАналитики = "СтатьяБюджета, Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5, Аналитика6";               
	Если ВидБюджета = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств Тогда
		ВидБюджетаПараметр = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов;
	Иначе
		ВидБюджетаПараметр = ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств;
	КонецЕсли;                                            
	СтатьиТКТаблица = ЭтотОбъект.СтатьиТК.Выгрузить();
	ПараметрСтатья = ПланированиеПотребностей.ПараметрыПотребностей(Неопределено, СтатьиТКТаблица.ВыгрузитьКолонку("ТоварнаяКатегория"), 
																	СвойстваАналитики, Новый Структура("ВидБюджета", ВидБюджетаПараметр));    
	Для Каждого Строка Из СтатьиТКТаблица Цикл
		ДанныеЗаполнения = ПараметрСтатья.Получить(Строка.ТоварнаяКатегория);         
		Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда   
			ЗаполнитьЗначенияСвойств(Строка, ДанныеЗаполнения, СвойстваАналитики);
		КонецЕсли;
	КонецЦикла; 
	
	Результат = ПланированиеПотребностей.ЗаменаСтатейИАналитикПоНастройкамЛимитов(ТекущаяДата(), СтатьиТКТаблица);
	
	Для Каждого Строка Из ЭтотОбъект.СтатьиТК Цикл   
		Если Не ЗначениеЗаполнено(Строка.СтатьяБюджета) Тогда
			ДанныеЗаполнения = Результат.НайтиСтроки(Новый Структура("ТоварнаяКатегория", Строка.ТоварнаяКатегория));    
			Если ДанныеЗаполнения.Количество() Тогда         
				ЗаполнитьЗначенияСвойств(Строка, ДанныеЗаполнения[0], СвойстваАналитики);
			КонецЕсли;                                           
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)    
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтатьиТКПриИзмененииНаСервере()
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтатьиТКПриИзменении(Элемент)
	СтатьиТКПриИзмененииНаСервере();
КонецПроцедуры
